'''
@Author: misaka7690
@Description: 该文件将一个numpy数组转为8*8的0 1 矩阵,以显示对应的数字
'''

import numpy as np

narray=np.array([ 0.,  1., 11., 16., 16.,  4.,  0.,  0.,  0.,  7., 16.,  8., 14.,
       11.,  0.,  0.,  0.,  0.,  0., 10., 16.,  6.,  0.,  0.,  0.,  0.,
        0., 15., 16.,  6.,  0.,  0.,  0.,  0.,  0.,  0.,  8., 16.,  2.,
        0.,  0.,  1.,  5.,  0.,  0., 14.,  9.,  0.,  0.,  4., 16., 10.,
       11., 16.,  6.,  0.,  0.,  1., 13., 16., 16., 10.,  0.,  0.])


narray[narray>0]=1
narray.resize((8,8))
np.savetxt('num.txt',narray,fmt='%d')